# Задание 1. Три списка
#  Даны три списка.
#  array_1 = [1, 5, 10, 20, 40, 80, 100]
#  array_2 = [6, 7, 20, 80, 100]
#  array_3 = [3, 4, 15, 20, 30, 70, 80, 120]
#  Нужно выполнить две задачи:
#  1. найти элементы, которые есть в каждом списке;
#  2. найти элементы из первого списка, которых нет во втором и третьем списках.
#  Каждую задачу нужно выполнить двумя способами:
#  1. без использования множеств;
#  2. с использованием множеств.
#  Пример выполнения на других данных:
#  array_1 = [1, 2, 3, 4]
#  array_2 = [2, 4]
#  array_3 = [2, 3]
#  Вывод:
#  Задача 1:
#  Решение без множеств: 2
#  Решение с множествами: 2
#  Задача 2:
#  Решение без множеств: 1
#  Решение с множествами: 1


array_1 = [1, 5, 10, 20, 40, 80, 100]
array_2 = [6, 7, 20, 80, 100]
array_3 = [3, 4, 15, 20, 30, 70, 80, 120]

array_1_3 = array_1 + array_2 + array_3

array_all = []

for el in array_1_3:
    if el not in array_all and all(el in array for array in [array_1, array_2, array_3]):
        array_all.append(el)
    
print("Задача 1. Без использования множеств", len(array_all))

#####################################################################################

array_1_set = set(array_1)
array_2_set = set(array_2)
array_3_set = set(array_3)

array_set = array_1_set & array_2_set & array_3_set

#array_set = set(array_1) & set(array_2) & set(array_3) такое решение гораздо проще

print("Задача 1. C использованиtv множеств", len(array_set))

#####################################################################################

array_all = []

for el in array_1:
    if el not in array_2 and el not in array_3:
        array_all.append(el)
    
print("Задача 2. Без использования множеств", array_all)

#####################################################################################


array_set = set(array_1) - set(array_2) - set(array_3)

print("Задача 2. C использованиtv множеств", array_set)